tutorials/ObliqueShock_AeroFoam/ObliqueShock_D/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (986.848 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (986.848 0 0);
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    top             
    {
        type            fixedValue;
        value           uniform (891.342 -172.297 0);
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
