tutorials/ObliqueShock_AeroFoam/ObliqueShock_D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "shock";
    instance        "constant/polyMesh";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (0.0 0.0 0.0)
    (4.12836 0.0 0.0)
    (4.12836 1.0 0.0)
    (0.0 1.0 0.0)
    (0.0 0.0 0.1)
    (4.12836 0.0 0.1)
    (4.12836 1.0 0.1)
    (0.0 1.0 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (320 80 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 4 7 3)
    )
    patch outlet 
    (
        (2 6 5 1)
    )
    symmetryPlane bottom 
    (
        (1 5 4 0)
    )
    patch top 
    (
        (3 7 6 2)
    )
    empty defaultFaces
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
